app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2016-08-17 18:36:30.292342"], ["updated_at", "2016-08-17 18:36:30.292342"]]
---
  def create

    @post = Post.create({title: params[:title], description: params[:description]})